Revit 2026 API

# WireframeBuilderAddCurve Method

---

Add a curve to the shape representation stored in this WireframeBuilder.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddCurve(
	Curve GCurve
)
```
```vb
Public Sub AddCurve (
	GCurve As Curve
)
```
```cpp
public:
void AddCurve(
	Curve^ GCurve
)
```
```fsharp
member AddCurve :
        GCurve : Curve -> unit
```

#### Parameters

GCurve Curve
     The curve to be added.

| Exception | Condition |
| --- | --- |
| ArgumentException | GCurve is not acceptable for a wireframe shape representation. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

WireframeBuilder Class

Autodesk.Revit.DB Namespace